In [1]:
# Data input and output

In [4]:
import pandas as pd

In [5]:
pwd

'C:\\Users\\Usuario\\Desktop\\OpenWebinars\\Tratamiento de datos'

In [9]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [10]:
df = pd.read_csv('example')

In [11]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [12]:
df.to_csv('My_output', index = False)

In [14]:
pd.read_csv('My_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [9]:
pd.read_excel('Excel_Sample.xlsx')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [10]:
df = pd.read_excel('Excel_Sample.xlsx')

In [11]:
df.to_excel('Excel_Sample2.xlsx',sheet_name = 'NewSheet')

In [12]:
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [14]:
data = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/banklist.html')

In [15]:
data

[                             Bank Name               City  ST   CERT  \
 0           First City Bank of Florida  Fort Walton Beach  FL  16748
 1                 The First State Bank      Barboursville  WV  14361
 2                   Ericson State Bank            Ericson  NE  18265
 3     City National Bank of New Jersey             Newark  NJ  21111
 4                        Resolute Bank             Maumee  OH  58317
 ..                                 ...                ...  ..    ...
 557                 Superior Bank, FSB           Hinsdale  IL  32646
 558                Malta National Bank              Malta  OH   6629
 559    First Alliance Bank & Trust Co.         Manchester  NH  34264
 560  National State Bank of Metropolis         Metropolis  IL   3815
 561                   Bank of Honolulu           Honolulu  HI  21029

                    Acquiring Institution       Closing Date
 0              United Fidelity Bank, fsb   October 16, 2020
 1                         MVB Bank, Inc.      April 3, 2020
 2             Farmers and Merchants Bank  February 14, 2020
 3                        Industrial Bank   November 1, 2019
 4                     Buckeye State Bank   October 25, 2019
 ..                                   ...                ...
 557                Superior Federal, FSB      July 27, 2001
 558                    North Valley Bank        May 3, 2001
 559  Southern New Hampshire Bank & Trust   February 2, 2001
 560              Banterra Bank of Marion  December 14, 2000
 561                   Bank of the Orient   October 13, 2000

 [562 rows x 6 columns]]

In [16]:
type(data)

list

In [19]:
data[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020"
1,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
2,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
3,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
4,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"

In [20]:
# SQL

from sqlalchemy import create_engine

In [24]:
# mini bbdd
engine = create_engine('sqlite:///:memory:')

In [25]:
df.to_sql('my_table', engine)

In [26]:
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [27]:
sqldf = pd.read_sql('my_table',  con = engine)

In [29]:
sqldf

   index  Unnamed: 0   a   b   c   d
0      0           0   0   1   2   3
1      1           1   4   5   6   7
2      2           2   8   9  10  11
3      3           3  12  13  14  15